/**
 * Константы для рендеринга графиков
 */

/** Дефолтные значения конфигурации */
export const DEFAULT_PADDING_PERCENT = 0.05;
export const DEFAULT_BOTTOM_LABEL_SPACE = 25;
export const DEFAULT_LEFT_LABEL_SPACE = 20;
export const DEFAULT_RIGHT_CURRENT_VALUE_WIDTH = 150;
export const DEFAULT_RIGHT_CURRENT_VALUE_PADDING = 20;
export const DEFAULT_MIN_TIME_RANGE = 2 * 60 * 10; // 2 минуты в десятых долях секунды

/**
 * Возможные интервалы для вертикальных осей в десятых долях секунды
 */
export const GRID_INTERVALS_TENTH_OF_SECOND = [
  30 * 10,          // 30 секунд
  60 * 10,          // 1 минута
  5 * 60 * 10,      // 5 минут
  10 * 60 * 10,     // 10 минут
  30 * 60 * 10,     // 30 минут
  60 * 60 * 10,     // 1 час
  2 * 60 * 60 * 10, // 2 часа
  4 * 60 * 60 * 10, // 4 часа
  8 * 60 * 60 * 10, // 8 часов
  24 * 60 * 60 * 10, // сутки
] as const;

/**
 * Возможные интервалы для горизонтальных осей в килобайтах
 */
export const GRID_INTERVALS_KB = [
  10 * 1024,              // 10MB
  50 * 1024,              // 50MB
  100 * 1024,             // 100MB
  300 * 1024,             // 300MB
  500 * 1024,             // 500MB
  800 * 1024,             // 800MB
  1024 * 1024,            // 1GB
  2 * 1024 * 1024,        // 2GB
  3 * 1024 * 1024,        // 3GB
  4 * 1024 * 1024,        // 4GB
  5 * 1024 * 1024,        // 5GB
  6 * 1024 * 1024,        // 6GB
  7 * 1024 * 1024,        // 7GB
  8 * 1024 * 1024,        // 8GB
  9 * 1024 * 1024,        // 9GB
  10 * 1024 * 1024,       // 10GB
  30 * 1024 * 1024,       // 30GB
  50 * 1024 * 1024,       // 50GB
  80 * 1024 * 1024,       // 80GB
  100 * 1024 * 1024,      // 100GB
  300 * 1024 * 1024,      // 300GB
  500 * 1024 * 1024,      // 500GB
  800 * 1024 * 1024,      // 800GB
  1024 * 1024 * 1024,     // 1TB
  2 * 1024 * 1024 * 1024, // 2TB
] as const;

/** Максимальное количество вертикальных линий сетки */
export const MAX_VERTICAL_GRID_LINES = 10;

/** Максимальное количество горизонтальных линий сетки */
export const MAX_HORIZONTAL_GRID_LINES = 5;
